app/Controllers/Adm/Saida.php

    public function excluir($id=null){
        $model = new itenSaidaModel();

        $model->where('CODITEMSAIDA',$id)->delete();
---
DELETE FROM `item_saida`
WHERE `CODITEMSAIDA` = '58'