app/Models/CategoriaModel.php

    public function getCat(){
        return $this->findAll();
---
SELECT *
FROM `categoria`