app/Models/EntradaModel.php

SELECT *
FROM `entrada`
WHERE `DATA` >= '2024-04-26 00:00:00'
AND `DATA` <= '2024-04-29 23:59:59'
---
    public function getEntrada($de=null,$ate=null){
            return $this->where('DATA >= ',$de)
                        ->where('DATA <=',$ate)
                        ->findAll();