app/Models/EstoqueModel.php

SELECT `unidade`.`TIPO`, `categoria`.`NOME` AS `categoria`, `produto`.`NOME` AS `produto`, `produto`.`MARCA`, `estoque`.`CODPRODUTO`, `estoque`.`QUANTIDADE`, `estoque`.`CODESTOQUE`
FROM `estoque`
JOIN `produto` ON `produto`.`CODPRODUTO` = `estoque`.`CODPRODUTO`
JOIN `unidade` ON `unidade`.`CODUNIDADE` = `produto`.`CODUNIDADE`
JOIN `categoria` ON `categoria`.`CODCATEGORIA` = `produto`.`CODCATEGORIA`
---
    public function getEstoque(){
            return $this->select('
                                unidade.TIPO,
                                categoria.NOME AS categoria,
                                produto.NOME AS produto,
                                produto.MARCA,
                                estoque.CODPRODUTO,
                                estoque.QUANTIDADE,
                                estoque.CODESTOQUE')
                        ->join('produto','produto.CODPRODUTO = estoque.CODPRODUTO')
                        ->join('unidade','unidade.CODUNIDADE = produto.CODUNIDADE')
                        ->join('categoria','categoria.CODCATEGORIA = produto.CODCATEGORIA')
                        ->findAll();