app/Models/InventarioModel.php

    public function getInventario(){
        return $this->select('
                    inventario.CODPRODUTO,
                    inventario.QUANTIDADE,
                    inventario.CODINVENTARIO,
                    unidade.TIPO,
                    produto.NOME')
                    ->join('produto','produto.CODPRODUTO = inventario.CODPRODUTO')
                    ->join('unidade','unidade.CODUNIDADE = produto.CODUNIDADE')
                    ->findAll();
---
SELECT `inventario`.`CODPRODUTO`, `inventario`.`QUANTIDADE`, `inventario`.`CODINVENTARIO`, `unidade`.`TIPO`, `produto`.`NOME`
FROM `inventario`
JOIN `produto` ON `produto`.`CODPRODUTO` = `inventario`.`CODPRODUTO`
JOIN `unidade` ON `unidade`.`CODUNIDADE` = `produto`.`CODUNIDADE`