app/Models/itenSaidaModel.php

    public function getItem($id=null){
            return $this->select(
                'item_saida.CODPRODUTO,
                item_saida.QUANTIDADE,
                item_saida.CODITEMSAIDA,
                item_saida.CODSAIDA,
                produto.NOME AS PRODUTO,
                setor.NOME AS SETOR')
            ->join('produto','produto.CODPRODUTO = item_saida.CODPRODUTO')
            ->join('setor','setor.CODSETOR = item_saida.CODSETOR')
            ->where(['CODSAIDA' => $id])
            ->findAll();
---
SELECT `item_saida`.`CODPRODUTO`, `item_saida`.`QUANTIDADE`, `item_saida`.`CODITEMSAIDA`, `item_saida`.`CODSAIDA`, `produto`.`NOME` AS `PRODUTO`, `setor`.`NOME` AS `SETOR`
FROM `item_saida`
JOIN `produto` ON `produto`.`CODPRODUTO` = `item_saida`.`CODPRODUTO`
JOIN `setor` ON `setor`.`CODSETOR` = `item_saida`.`CODSETOR`
WHERE `CODSAIDA` IS NULL