app/Models/itensOrdemModel.php

SELECT `item_ordem`.`CODPRODUTO`, `item_ordem`.`QUANTIDADE`, `item_ordem`.`VALORUNIT`, `item_ordem`.`DESCRICAO`, `item_ordem`.`CODORDEM`, `item_ordem`.`CODITEMORDEM`, `produto`.`NOME`
FROM `item_ordem`
JOIN `produto` ON `produto`.`CODPRODUTO` = `item_ordem`.`CODPRODUTO`
WHERE `CODORDEM` IS NULL
---
    public function getItem($id=null){
            return $this->select(
                'item_ordem.CODPRODUTO,
                item_ordem.QUANTIDADE,
                item_ordem.VALORUNIT,
                item_ordem.DESCRICAO,
                item_ordem.CODORDEM,
                item_ordem.CODITEMORDEM,
                produto.NOME')
            ->join('produto','produto.CODPRODUTO = item_ordem.CODPRODUTO')
            ->where(['CODORDEM' => $id])
            ->findAll();