app/Models/ProdutoModel.php

SELECT *
FROM `produto`
---
    public function getProduto(){
        return $this->findAll();