app/Models/SetorModel.php

SELECT *
FROM `setor`
---
    public function getSetor(){
        return $this->findAll();