app/Models/UnidadeModel.php

SELECT *
FROM `unidade`
---
    public function getUnidade(){
        return $this->findAll();